programming/java/code/jkee-tutorial/mood.org
#+title: mood
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

* layout

#+BEGIN_EXAMPLE
  .
  ├── resources
  │   └── images
  │       ├── duke.cookies.gif
  │       ├── duke.handsOnHips.gif
  │       ├── duke.pensive.gif
  │       ├── duke.snooze.gif
  │       ├── duke.thumbsup.gif
  │       └── duke.waving.gif
  └── WEB-INF
      └── classes
          └── mood
              ├── MoodServlet.class
              ├── SimpleServletListener.class
              └── TimeOfDayFilter.class
#+END_EXAMPLE

