programming/java/code/jkee-tutorial/mood.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mood</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">mood</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaab8205">layout</a></li>
<li><a href="#org3afc2e6"><code>MoodServlet.java</code></a></li>
<li><a href="#org20baa5f"><code>SimpleServletListener.java</code></a></li>
<li><a href="#org9664b4d"><code>TimeOfDayFilter.java</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaab8205" class="outline-2">
<h2 id="orgaab8205">layout</h2>
<div class="outline-text-2" id="text-orgaab8205">
<pre class="example">
.
├── resources
│   └── images
│       ├── duke.cookies.gif
│       ├── duke.handsOnHips.gif
│       ├── duke.pensive.gif
│       ├── duke.snooze.gif
│       ├── duke.thumbsup.gif
│       └── duke.waving.gif
└── WEB-INF
    └── classes
        └── mood
            ├── MoodServlet.class
            ├── SimpleServletListener.class
            └── TimeOfDayFilter.class
</pre>
</div>
</div>
